1s/ERP/Conf/Enums/СоставыУчастниковРетроБонусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СоставыУчастниковРетроБонусов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИНН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СегментыПартнеров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Соглашения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/СоставыУчастниковРетроБонусов/Ext/ManagerModule.bsl
//@strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИспользуютсяСегменты = ПолучитьФункциональнуюОпцию("ИспользоватьСегментыПартнеров");
	ИспользуютсяДоговораСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами");
	ИспользуютсяТиповыеСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьТиповыеСоглашенияСКлиентами");
	ИспользуютсяИндивидуальныеСоглашенияСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьИндивидуальныеСоглашенияСКлиентами");
	
	ДанныеВыбора = Новый СписокЗначений; // СписокЗначений из ПеречислениеСсылка.СоставыУчастниковРетроБонусов
	ДанныеВыбора.Добавить(ИНН);
	ДанныеВыбора.Добавить(Контрагенты);
	ДанныеВыбора.Добавить(Клиенты);
	
	Если ИспользуютсяСегменты Тогда
		ДанныеВыбора.Добавить(СегментыПартнеров);
	КонецЕсли;
	
	Если ИспользуютсяДоговораСКлиентами Тогда
		ДанныеВыбора.Добавить(Договоры);
	КонецЕсли;
	
	Если ИспользуютсяТиповыеСоглашенияСКлиентами
	 ИЛИ ИспользуютсяИндивидуальныеСоглашенияСКлиентами Тогда
		ДанныеВыбора.Добавить(Соглашения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
